zephyrproject-rtos/hal_infineon/aurix-illd/tc3x/Sfr/TC39xB/IfxMcds_bf.h
/** \brief Offset for Ifx_MCDS_MCX_CCL_Bits.CLR0 */
#define IFX_MCDS_MCX_CCL_CLR0_OFF (8u)

/** \brief Length for Ifx_MCDS_MCX_CCL_Bits.CLV0 */
#define IFX_MCDS_MCX_CCL_CLV0_LEN (1u)

/** \brief Mask for Ifx_MCDS_MCX_CCL_Bits.CLV0 */
#define IFX_MCDS_MCX_CCL_CLV0_MSK (0x1u)

/** \brief Offset for Ifx_MCDS_MCX_CCL_Bits.CLV0 */
#define IFX_MCDS_MCX_CCL_CLV0_OFF (15u)

/** \brief Length for Ifx_MCDS_MCX_CCL_Bits.INC1 */
#define IFX_MCDS_MCX_CCL_INC1_LEN (7u)

/** \brief Mask for Ifx_MCDS_MCX_CCL_Bits.INC1 */
#define IFX_MCDS_MCX_CCL_INC1_MSK (0x7fu)

/** \brief Offset for Ifx_MCDS_MCX_CCL_Bits.INC1 */
#define IFX_MCDS_MCX_CCL_INC1_OFF (16u)

/** \brief Length for Ifx_MCDS_MCX_CCL_Bits.ILV1 */
#define IFX_MCDS_MCX_CCL_ILV1_LEN (1u)

/** \brief Mask for Ifx_MCDS_MCX_CCL_Bits.ILV1 */
#define IFX_MCDS_MCX_CCL_ILV1_MSK (0x1u)

/** \brief Offset for Ifx_MCDS_MCX_CCL_Bits.ILV1 */
#define IFX_MCDS_MCX_CCL_ILV1_OFF (23u)

/** \brief Length for Ifx_MCDS_MCX_CCL_Bits.CLR1 */
#define IFX_MCDS_MCX_CCL_CLR1_LEN (6u)

/** \brief Mask for Ifx_MCDS_MCX_CCL_Bits.CLR1 */
#define IFX_MCDS_MCX_CCL_CLR1_MSK (0x3fu)

/** \brief Offset for Ifx_MCDS_MCX_CCL_Bits.CLR1 */
#define IFX_MCDS_MCX_CCL_CLR1_OFF (24u)

/** \brief Length for Ifx_MCDS_MCX_CCL_Bits.CLV1 */
#define IFX_MCDS_MCX_CCL_CLV1_LEN (1u)

/** \brief Mask for Ifx_MCDS_MCX_CCL_Bits.CLV1 */
#define IFX_MCDS_MCX_CCL_CLV1_MSK (0x1u)

/** \brief Offset for Ifx_MCDS_MCX_CCL_Bits.CLV1 */
#define IFX_MCDS_MCX_CCL_CLV1_OFF (31u)

/** \brief Length for Ifx_MCDS_MCX_LMT_Bits.LIMIT */
#define IFX_MCDS_MCX_LMT_LIMIT_LEN (16u)

/** \brief Mask for Ifx_MCDS_MCX_LMT_Bits.LIMIT */
#define IFX_MCDS_MCX_LMT_LIMIT_MSK (0xffffu)

/** \brief Offset for Ifx_MCDS_MCX_LMT_Bits.LIMIT */
#define IFX_MCDS_MCX_LMT_LIMIT_OFF (0u)

/** \brief Length for Ifx_MCDS_MCX_LMT_Bits.MOD0 */
#define IFX_MCDS_MCX_LMT_MOD0_LEN (1u)

/** \brief Mask for Ifx_MCDS_MCX_LMT_Bits.MOD0 */
#define IFX_MCDS_MCX_LMT_MOD0_MSK (0x1u)

/** \brief Offset for Ifx_MCDS_MCX_LMT_Bits.MOD0 */
#define IFX_MCDS_MCX_LMT_MOD0_OFF (30u)

/** \brief Length for Ifx_MCDS_MCX_LMT_Bits.MOD1 */
#define IFX_MCDS_MCX_LMT_MOD1_LEN (1u)

/** \brief Mask for Ifx_MCDS_MCX_LMT_Bits.MOD1 */
#define IFX_MCDS_MCX_LMT_MOD1_MSK (0x1u)

/** \brief Offset for Ifx_MCDS_MCX_LMT_Bits.MOD1 */
#define IFX_MCDS_MCX_LMT_MOD1_OFF (31u)

/** \brief Length for Ifx_MCDS_MCX_CNT_Bits.COUNT */
#define IFX_MCDS_MCX_CNT_COUNT_LEN (16u)

/** \brief Mask for Ifx_MCDS_MCX_CNT_Bits.COUNT */
#define IFX_MCDS_MCX_CNT_COUNT_MSK (0xffffu)

/** \brief Offset for Ifx_MCDS_MCX_CNT_Bits.COUNT */
#define IFX_MCDS_MCX_CNT_COUNT_OFF (0u)

/** \brief Length for Ifx_MCDS_MCXPERFCFG_Bits.DFLASH_MASTER */
#define IFX_MCDS_MCXPERFCFG_DFLASH_MASTER_LEN (4u)

/** \brief Mask for Ifx_MCDS_MCXPERFCFG_Bits.DFLASH_MASTER */
#define IFX_MCDS_MCXPERFCFG_DFLASH_MASTER_MSK (0xfu)

/** \brief Offset for Ifx_MCDS_MCXPERFCFG_Bits.DFLASH_MASTER */
#define IFX_MCDS_MCXPERFCFG_DFLASH_MASTER_OFF (0u)

/** \brief Length for Ifx_MCDS_MCXPERFCFG_Bits.DFLASH_MASTER_EN */
#define IFX_MCDS_MCXPERFCFG_DFLASH_MASTER_EN_LEN (1u)

/** \brief Mask for Ifx_MCDS_MCXPERFCFG_Bits.DFLASH_MASTER_EN */
#define IFX_MCDS_MCXPERFCFG_DFLASH_MASTER_EN_MSK (0x1u)

/** \brief Offset for Ifx_MCDS_MCXPERFCFG_Bits.DFLASH_MASTER_EN */
#define IFX_MCDS_MCXPERFCFG_DFLASH_MASTER_EN_OFF (7u)

/** \brief Length for Ifx_MCDS_MCXPERFCFG_Bits.PFLASH_MASTER */
#define IFX_MCDS_MCXPERFCFG_PFLASH_MASTER_LEN (4u)

/** \brief Mask for Ifx_MCDS_MCXPERFCFG_Bits.PFLASH_MASTER */
#define IFX_MCDS_MCXPERFCFG_PFLASH_MASTER_MSK (0xfu)

/** \brief Offset for Ifx_MCDS_MCXPERFCFG_Bits.PFLASH_MASTER */
#define IFX_MCDS_MCXPERFCFG_PFLASH_MASTER_OFF (8u)

/** \brief Length for Ifx_MCDS_MCXPERFCFG_Bits.PFLASH_MASTER_EN */
#define IFX_MCDS_MCXPERFCFG_PFLASH_MASTER_EN_LEN (1u)

/** \brief Mask for Ifx_MCDS_MCXPERFCFG_Bits.PFLASH_MASTER_EN */
#define IFX_MCDS_MCXPERFCFG_PFLASH_MASTER_EN_MSK (0x1u)

/** \brief Offset for Ifx_MCDS_MCXPERFCFG_Bits.PFLASH_MASTER_EN */
#define IFX_MCDS_MCXPERFCFG_PFLASH_MASTER_EN_OFF (15u)

/** \brief Length for Ifx_MCDS_MCXPERFCFG_Bits.PFLASH_ACC_EN */
#define IFX_MCDS_MCXPERFCFG_PFLASH_ACC_EN_LEN (1u)

/** \brief Mask for Ifx_MCDS_MCXPERFCFG_Bits.PFLASH_ACC_EN */
#define IFX_MCDS_MCXPERFCFG_PFLASH_ACC_EN_MSK (0x1u)

/** \brief Offset for Ifx_MCDS_MCXPERFCFG_Bits.PFLASH_ACC_EN */
#define IFX_MCDS_MCXPERFCFG_PFLASH_ACC_EN_OFF (16u)

/** \brief Length for Ifx_MCDS_MCXPERFCFG_Bits.PFLASH_WAIT_EN */
#define IFX_MCDS_MCXPERFCFG_PFLASH_WAIT_EN_LEN (1u)

/** \brief Mask for Ifx_MCDS_MCXPERFCFG_Bits.PFLASH_WAIT_EN */
#define IFX_MCDS_MCXPERFCFG_PFLASH_WAIT_EN_MSK (0x1u)

/** \brief Offset for Ifx_MCDS_MCXPERFCFG_Bits.PFLASH_WAIT_EN */
#define IFX_MCDS_MCXPERFCFG_PFLASH_WAIT_EN_OFF (17u)

/** \brief Length for Ifx_MCDS_MCXPERFCFG_Bits.PFLASH_PRE_EN */
#define IFX_MCDS_MCXPERFCFG_PFLASH_PRE_EN_LEN (1u)

/** \brief Mask for Ifx_MCDS_MCXPERFCFG_Bits.PFLASH_PRE_EN */
#define IFX_MCDS_MCXPERFCFG_PFLASH_PRE_EN_MSK (0x1u)

/** \brief Offset for Ifx_MCDS_MCXPERFCFG_Bits.PFLASH_PRE_EN */
#define IFX_MCDS_MCXPERFCFG_PFLASH_PRE_EN_OFF (18u)

/** \brief Length for Ifx_MCDS_MCXPERFCFG_Bits.PFLASH_LINE_EN */
#define IFX_MCDS_MCXPERFCFG_PFLASH_LINE_EN_LEN (1u)

/** \brief Mask for Ifx_MCDS_MCXPERFCFG_Bits.PFLASH_LINE_EN */
#define IFX_MCDS_MCXPERFCFG_PFLASH_LINE_EN_MSK (0x1u)

/** \brief Offset for Ifx_MCDS_MCXPERFCFG_Bits.PFLASH_LINE_EN */
#define IFX_MCDS_MCXPERFCFG_PFLASH_LINE_EN_OFF (19u)

/** \brief Length for Ifx_MCDS_MCXPERFCFG_Bits.CPUMEM_MASTER */
#define IFX_MCDS_MCXPERFCFG_CPUMEM_MASTER_LEN (4u)

/** \brief Mask for Ifx_MCDS_MCXPERFCFG_Bits.CPUMEM_MASTER */
#define IFX_MCDS_MCXPERFCFG_CPUMEM_MASTER_MSK (0xfu)

/** \brief Offset for Ifx_MCDS_MCXPERFCFG_Bits.CPUMEM_MASTER */
#define IFX_MCDS_MCXPERFCFG_CPUMEM_MASTER_OFF (20u)

/** \brief Length for Ifx_MCDS_MCXPERFCFG_Bits.CPUMEM_MASTER_EN */
#define IFX_MCDS_MCXPERFCFG_CPUMEM_MASTER_EN_LEN (1u)

/** \brief Mask for Ifx_MCDS_MCXPERFCFG_Bits.CPUMEM_MASTER_EN */
#define IFX_MCDS_MCXPERFCFG_CPUMEM_MASTER_EN_MSK (0x1u)

/** \brief Offset for Ifx_MCDS_MCXPERFCFG_Bits.CPUMEM_MASTER_EN */
#define IFX_MCDS_MCXPERFCFG_CPUMEM_MASTER_EN_OFF (27u)

/** \brief Length for Ifx_MCDS_MCXPERFCFG_Bits.PSPR_HIT_EN */
#define IFX_MCDS_MCXPERFCFG_PSPR_HIT_EN_LEN (1u)

/** \brief Mask for Ifx_MCDS_MCXPERFCFG_Bits.PSPR_HIT_EN */
#define IFX_MCDS_MCXPERFCFG_PSPR_HIT_EN_MSK (0x1u)

/** \brief Offset for Ifx_MCDS_MCXPERFCFG_Bits.PSPR_HIT_EN */
#define IFX_MCDS_MCXPERFCFG_PSPR_HIT_EN_OFF (28u)

