zephyrproject-rtos/hal_infineon/aurix-illd/tc3x/Sfr/TC39xB/IfxMcds_bf.h
/** \brief Length for Ifx_MCDS_TCXPAL_MAP_Bits.GRAIN */
#define IFX_MCDS_TCXPAL_MAP_GRAIN_LEN (3u)

/** \brief Mask for Ifx_MCDS_TCXPAL_MAP_Bits.GRAIN */
#define IFX_MCDS_TCXPAL_MAP_GRAIN_MSK (0x7u)

/** \brief Offset for Ifx_MCDS_TCXPAL_MAP_Bits.GRAIN */
#define IFX_MCDS_TCXPAL_MAP_GRAIN_OFF (28u)

/** \brief Length for Ifx_MCDS_TCXPAL_MAP_Bits.EN */
#define IFX_MCDS_TCXPAL_MAP_EN_LEN (1u)

/** \brief Mask for Ifx_MCDS_TCXPAL_MAP_Bits.EN */
#define IFX_MCDS_TCXPAL_MAP_EN_MSK (0x1u)

/** \brief Offset for Ifx_MCDS_TCXPAL_MAP_Bits.EN */
#define IFX_MCDS_TCXPAL_MAP_EN_OFF (31u)

/** \brief Length for Ifx_MCDS_TCXEA_BND_Bits.BOUND */
#define IFX_MCDS_TCXEA_BND_BOUND_LEN (32u)

/** \brief Mask for Ifx_MCDS_TCXEA_BND_Bits.BOUND */
#define IFX_MCDS_TCXEA_BND_BOUND_MSK (0xffffffffu)

/** \brief Offset for Ifx_MCDS_TCXEA_BND_Bits.BOUND */
#define IFX_MCDS_TCXEA_BND_BOUND_OFF (0u)

/** \brief Length for Ifx_MCDS_TCXEA_RNG_Bits.RANGE */
#define IFX_MCDS_TCXEA_RNG_RANGE_LEN (32u)

/** \brief Mask for Ifx_MCDS_TCXEA_RNG_Bits.RANGE */
#define IFX_MCDS_TCXEA_RNG_RANGE_MSK (0xffffffffu)

/** \brief Offset for Ifx_MCDS_TCXEA_RNG_Bits.RANGE */
#define IFX_MCDS_TCXEA_RNG_RANGE_OFF (0u)

/** \brief Length for Ifx_MCDS_TCXWD_BND_Bits.BOUND_31_0 */
#define IFX_MCDS_TCXWD_BND_BOUND_31_0_LEN (32u)

/** \brief Mask for Ifx_MCDS_TCXWD_BND_Bits.BOUND_31_0 */
#define IFX_MCDS_TCXWD_BND_BOUND_31_0_MSK (0xffffffffu)

/** \brief Offset for Ifx_MCDS_TCXWD_BND_Bits.BOUND_31_0 */
#define IFX_MCDS_TCXWD_BND_BOUND_31_0_OFF (0u)

/** \brief Length for Ifx_MCDS_TCXWD_HBND_Bits.BOUND_63_32 */
#define IFX_MCDS_TCXWD_HBND_BOUND_63_32_LEN (32u)

/** \brief Mask for Ifx_MCDS_TCXWD_HBND_Bits.BOUND_63_32 */
#define IFX_MCDS_TCXWD_HBND_BOUND_63_32_MSK (0xffffffffu)

/** \brief Offset for Ifx_MCDS_TCXWD_HBND_Bits.BOUND_63_32 */
#define IFX_MCDS_TCXWD_HBND_BOUND_63_32_OFF (0u)

/** \brief Length for Ifx_MCDS_TCXWD_RNG_Bits.RANGE_31_0 */
#define IFX_MCDS_TCXWD_RNG_RANGE_31_0_LEN (32u)

/** \brief Mask for Ifx_MCDS_TCXWD_RNG_Bits.RANGE_31_0 */
#define IFX_MCDS_TCXWD_RNG_RANGE_31_0_MSK (0xffffffffu)

/** \brief Offset for Ifx_MCDS_TCXWD_RNG_Bits.RANGE_31_0 */
#define IFX_MCDS_TCXWD_RNG_RANGE_31_0_OFF (0u)

/** \brief Length for Ifx_MCDS_TCXWD_HRNG_Bits.RANGE_63_32 */
#define IFX_MCDS_TCXWD_HRNG_RANGE_63_32_LEN (32u)

/** \brief Mask for Ifx_MCDS_TCXWD_HRNG_Bits.RANGE_63_32 */
#define IFX_MCDS_TCXWD_HRNG_RANGE_63_32_MSK (0xffffffffu)

/** \brief Offset for Ifx_MCDS_TCXWD_HRNG_Bits.RANGE_63_32 */
#define IFX_MCDS_TCXWD_HRNG_RANGE_63_32_OFF (0u)

/** \brief Length for Ifx_MCDS_TCXWD_MSK_Bits.MASK_31_0 */
#define IFX_MCDS_TCXWD_MSK_MASK_31_0_LEN (32u)

/** \brief Mask for Ifx_MCDS_TCXWD_MSK_Bits.MASK_31_0 */
#define IFX_MCDS_TCXWD_MSK_MASK_31_0_MSK (0xffffffffu)

/** \brief Offset for Ifx_MCDS_TCXWD_MSK_Bits.MASK_31_0 */
#define IFX_MCDS_TCXWD_MSK_MASK_31_0_OFF (0u)

/** \brief Length for Ifx_MCDS_TCXWD_HMSK_Bits.MASK_63_32 */
#define IFX_MCDS_TCXWD_HMSK_MASK_63_32_LEN (32u)

/** \brief Mask for Ifx_MCDS_TCXWD_HMSK_Bits.MASK_63_32 */
#define IFX_MCDS_TCXWD_HMSK_MASK_63_32_MSK (0xffffffffu)

/** \brief Offset for Ifx_MCDS_TCXWD_HMSK_Bits.MASK_63_32 */
#define IFX_MCDS_TCXWD_HMSK_MASK_63_32_OFF (0u)

/** \brief Length for Ifx_MCDS_TCXWD_SGN_Bits.SIGN */
#define IFX_MCDS_TCXWD_SGN_SIGN_LEN (6u)

/** \brief Mask for Ifx_MCDS_TCXWD_SGN_Bits.SIGN */
#define IFX_MCDS_TCXWD_SGN_SIGN_MSK (0x3fu)

/** \brief Offset for Ifx_MCDS_TCXWD_SGN_Bits.SIGN */
#define IFX_MCDS_TCXWD_SGN_SIGN_OFF (0u)

/** \brief Length for Ifx_MCDS_TCXWD_SGN_Bits.EITHER */
#define IFX_MCDS_TCXWD_SGN_EITHER_LEN (1u)

/** \brief Mask for Ifx_MCDS_TCXWD_SGN_Bits.EITHER */
#define IFX_MCDS_TCXWD_SGN_EITHER_MSK (0x1u)

/** \brief Offset for Ifx_MCDS_TCXWD_SGN_Bits.EITHER */
#define IFX_MCDS_TCXWD_SGN_EITHER_OFF (14u)

/** \brief Length for Ifx_MCDS_TCXWD_SGN_Bits.BELOW */
#define IFX_MCDS_TCXWD_SGN_BELOW_LEN (1u)

/** \brief Mask for Ifx_MCDS_TCXWD_SGN_Bits.BELOW */
#define IFX_MCDS_TCXWD_SGN_BELOW_MSK (0x1u)

/** \brief Offset for Ifx_MCDS_TCXWD_SGN_Bits.BELOW */
#define IFX_MCDS_TCXWD_SGN_BELOW_OFF (15u)

/** \brief Length for Ifx_MCDS_TCXWD_SGN_Bits.RELOAD */
#define IFX_MCDS_TCXWD_SGN_RELOAD_LEN (4u)

/** \brief Mask for Ifx_MCDS_TCXWD_SGN_Bits.RELOAD */
#define IFX_MCDS_TCXWD_SGN_RELOAD_MSK (0xfu)

/** \brief Offset for Ifx_MCDS_TCXWD_SGN_Bits.RELOAD */
#define IFX_MCDS_TCXWD_SGN_RELOAD_OFF (16u)

/** \brief Length for Ifx_MCDS_TCXAC_BND_Bits.BOUND */
#define IFX_MCDS_TCXAC_BND_BOUND_LEN (14u)

/** \brief Mask for Ifx_MCDS_TCXAC_BND_Bits.BOUND */
#define IFX_MCDS_TCXAC_BND_BOUND_MSK (0x3fffu)

/** \brief Offset for Ifx_MCDS_TCXAC_BND_Bits.BOUND */
#define IFX_MCDS_TCXAC_BND_BOUND_OFF (0u)

/** \brief Length for Ifx_MCDS_TCXAC_RNG_Bits.RANGE */
#define IFX_MCDS_TCXAC_RNG_RANGE_LEN (14u)

/** \brief Mask for Ifx_MCDS_TCXAC_RNG_Bits.RANGE */
#define IFX_MCDS_TCXAC_RNG_RANGE_MSK (0x3fffu)

/** \brief Offset for Ifx_MCDS_TCXAC_RNG_Bits.RANGE */
#define IFX_MCDS_TCXAC_RNG_RANGE_OFF (0u)

/** \brief Length for Ifx_MCDS_TCXAC_MSK_Bits.SVM */
#define IFX_MCDS_TCXAC_MSK_SVM_LEN (1u)

/** \brief Mask for Ifx_MCDS_TCXAC_MSK_Bits.SVM */
#define IFX_MCDS_TCXAC_MSK_SVM_MSK (0x1u)

/** \brief Offset for Ifx_MCDS_TCXAC_MSK_Bits.SVM */
#define IFX_MCDS_TCXAC_MSK_SVM_OFF (0u)

/** \brief Length for Ifx_MCDS_TCXAC_MSK_Bits.MASTER */
#define IFX_MCDS_TCXAC_MSK_MASTER_LEN (4u)

/** \brief Mask for Ifx_MCDS_TCXAC_MSK_Bits.MASTER */
#define IFX_MCDS_TCXAC_MSK_MASTER_MSK (0xfu)

/** \brief Offset for Ifx_MCDS_TCXAC_MSK_Bits.MASTER */
#define IFX_MCDS_TCXAC_MSK_MASTER_OFF (1u)

/** \brief Length for Ifx_MCDS_TCXAC_MSK_Bits.SUBCHANNEL */
#define IFX_MCDS_TCXAC_MSK_SUBCHANNEL_LEN (7u)

/** \brief Mask for Ifx_MCDS_TCXAC_MSK_Bits.SUBCHANNEL */
#define IFX_MCDS_TCXAC_MSK_SUBCHANNEL_MSK (0x7fu)

/** \brief Offset for Ifx_MCDS_TCXAC_MSK_Bits.SUBCHANNEL */
#define IFX_MCDS_TCXAC_MSK_SUBCHANNEL_OFF (5u)

/** \brief Length for Ifx_MCDS_TCXAC_MSK_Bits.WR */
#define IFX_MCDS_TCXAC_MSK_WR_LEN (1u)

/** \brief Mask for Ifx_MCDS_TCXAC_MSK_Bits.WR */
#define IFX_MCDS_TCXAC_MSK_WR_MSK (0x1u)

/** \brief Offset for Ifx_MCDS_TCXAC_MSK_Bits.WR */
#define IFX_MCDS_TCXAC_MSK_WR_OFF (12u)

/** \brief Length for Ifx_MCDS_TCXAC_MSK_Bits.RD */
#define IFX_MCDS_TCXAC_MSK_RD_LEN (1u)

/** \brief Mask for Ifx_MCDS_TCXAC_MSK_Bits.RD */
#define IFX_MCDS_TCXAC_MSK_RD_MSK (0x1u)

