zephyrproject-rtos/hal_infineon/aurix-illd/tc3x/Sfr/TC39xB/IfxMcds_bf.h
/** \brief Length for Ifx_MCDS_SPBAC_BND_Bits.BOUND */
#define IFX_MCDS_SPBAC_BND_BOUND_LEN (14u)

/** \brief Mask for Ifx_MCDS_SPBAC_BND_Bits.BOUND */
#define IFX_MCDS_SPBAC_BND_BOUND_MSK (0x3fffu)

/** \brief Offset for Ifx_MCDS_SPBAC_BND_Bits.BOUND */
#define IFX_MCDS_SPBAC_BND_BOUND_OFF (0u)

/** \brief Length for Ifx_MCDS_SPBAC_RNG_Bits.RANGE */
#define IFX_MCDS_SPBAC_RNG_RANGE_LEN (14u)

/** \brief Mask for Ifx_MCDS_SPBAC_RNG_Bits.RANGE */
#define IFX_MCDS_SPBAC_RNG_RANGE_MSK (0x3fffu)

/** \brief Offset for Ifx_MCDS_SPBAC_RNG_Bits.RANGE */
#define IFX_MCDS_SPBAC_RNG_RANGE_OFF (0u)

/** \brief Length for Ifx_MCDS_SPBAC_MSK_Bits.SVM */
#define IFX_MCDS_SPBAC_MSK_SVM_LEN (1u)

/** \brief Mask for Ifx_MCDS_SPBAC_MSK_Bits.SVM */
#define IFX_MCDS_SPBAC_MSK_SVM_MSK (0x1u)

/** \brief Offset for Ifx_MCDS_SPBAC_MSK_Bits.SVM */
#define IFX_MCDS_SPBAC_MSK_SVM_OFF (0u)

/** \brief Length for Ifx_MCDS_SPBAC_MSK_Bits.MASTER */
#define IFX_MCDS_SPBAC_MSK_MASTER_LEN (4u)

/** \brief Mask for Ifx_MCDS_SPBAC_MSK_Bits.MASTER */
#define IFX_MCDS_SPBAC_MSK_MASTER_MSK (0xfu)

/** \brief Offset for Ifx_MCDS_SPBAC_MSK_Bits.MASTER */
#define IFX_MCDS_SPBAC_MSK_MASTER_OFF (1u)

/** \brief Length for Ifx_MCDS_SPBAC_MSK_Bits.SUBCHANNEL */
#define IFX_MCDS_SPBAC_MSK_SUBCHANNEL_LEN (7u)

/** \brief Mask for Ifx_MCDS_SPBAC_MSK_Bits.SUBCHANNEL */
#define IFX_MCDS_SPBAC_MSK_SUBCHANNEL_MSK (0x7fu)

/** \brief Offset for Ifx_MCDS_SPBAC_MSK_Bits.SUBCHANNEL */
#define IFX_MCDS_SPBAC_MSK_SUBCHANNEL_OFF (5u)

/** \brief Length for Ifx_MCDS_SPBAC_MSK_Bits.WR */
#define IFX_MCDS_SPBAC_MSK_WR_LEN (1u)

/** \brief Mask for Ifx_MCDS_SPBAC_MSK_Bits.WR */
#define IFX_MCDS_SPBAC_MSK_WR_MSK (0x1u)

/** \brief Offset for Ifx_MCDS_SPBAC_MSK_Bits.WR */
#define IFX_MCDS_SPBAC_MSK_WR_OFF (12u)

/** \brief Length for Ifx_MCDS_SPBAC_MSK_Bits.RD */
#define IFX_MCDS_SPBAC_MSK_RD_LEN (1u)

/** \brief Mask for Ifx_MCDS_SPBAC_MSK_Bits.RD */
#define IFX_MCDS_SPBAC_MSK_RD_MSK (0x1u)

/** \brief Offset for Ifx_MCDS_SPBAC_MSK_Bits.RD */
#define IFX_MCDS_SPBAC_MSK_RD_OFF (13u)

/** \brief Length for Ifx_MCDS_SPBAC_MSK_Bits.MSK */
#define IFX_MCDS_SPBAC_MSK_MSK_LEN (1u)

/** \brief Mask for Ifx_MCDS_SPBAC_MSK_Bits.MSK */
#define IFX_MCDS_SPBAC_MSK_MSK_MSK (0x1u)

/** \brief Offset for Ifx_MCDS_SPBAC_MSK_Bits.MSK */
#define IFX_MCDS_SPBAC_MSK_MSK_OFF (14u)

/** \brief Length for Ifx_MCDS_SPBEVT_Bits.EIQ0 */
#define IFX_MCDS_SPBEVT_EIQ0_LEN (2u)

/** \brief Mask for Ifx_MCDS_SPBEVT_Bits.EIQ0 */
#define IFX_MCDS_SPBEVT_EIQ0_MSK (0x3u)

/** \brief Offset for Ifx_MCDS_SPBEVT_Bits.EIQ0 */
#define IFX_MCDS_SPBEVT_EIQ0_OFF (0u)

/** \brief Length for Ifx_MCDS_SPBEVT_Bits.EIQ1 */
#define IFX_MCDS_SPBEVT_EIQ1_LEN (2u)

/** \brief Mask for Ifx_MCDS_SPBEVT_Bits.EIQ1 */
#define IFX_MCDS_SPBEVT_EIQ1_MSK (0x3u)

/** \brief Offset for Ifx_MCDS_SPBEVT_Bits.EIQ1 */
#define IFX_MCDS_SPBEVT_EIQ1_OFF (2u)

/** \brief Length for Ifx_MCDS_SPBEVT_Bits.EIQ2 */
#define IFX_MCDS_SPBEVT_EIQ2_LEN (2u)

/** \brief Mask for Ifx_MCDS_SPBEVT_Bits.EIQ2 */
#define IFX_MCDS_SPBEVT_EIQ2_MSK (0x3u)

/** \brief Offset for Ifx_MCDS_SPBEVT_Bits.EIQ2 */
#define IFX_MCDS_SPBEVT_EIQ2_OFF (4u)

/** \brief Length for Ifx_MCDS_SPBEVT_Bits.EIQ3 */
#define IFX_MCDS_SPBEVT_EIQ3_LEN (2u)

/** \brief Mask for Ifx_MCDS_SPBEVT_Bits.EIQ3 */
#define IFX_MCDS_SPBEVT_EIQ3_MSK (0x3u)

/** \brief Offset for Ifx_MCDS_SPBEVT_Bits.EIQ3 */
#define IFX_MCDS_SPBEVT_EIQ3_OFF (6u)

/** \brief Length for Ifx_MCDS_SPBEVT_Bits.EIQ4 */
#define IFX_MCDS_SPBEVT_EIQ4_LEN (2u)

/** \brief Mask for Ifx_MCDS_SPBEVT_Bits.EIQ4 */
#define IFX_MCDS_SPBEVT_EIQ4_MSK (0x3u)

/** \brief Offset for Ifx_MCDS_SPBEVT_Bits.EIQ4 */
#define IFX_MCDS_SPBEVT_EIQ4_OFF (8u)

/** \brief Length for Ifx_MCDS_SPBEVT_Bits.EIQ5 */
#define IFX_MCDS_SPBEVT_EIQ5_LEN (2u)

/** \brief Mask for Ifx_MCDS_SPBEVT_Bits.EIQ5 */
#define IFX_MCDS_SPBEVT_EIQ5_MSK (0x3u)

/** \brief Offset for Ifx_MCDS_SPBEVT_Bits.EIQ5 */
#define IFX_MCDS_SPBEVT_EIQ5_OFF (10u)

/** \brief Length for Ifx_MCDS_SPBEVT_Bits.EIQ6 */
#define IFX_MCDS_SPBEVT_EIQ6_LEN (2u)

/** \brief Mask for Ifx_MCDS_SPBEVT_Bits.EIQ6 */
#define IFX_MCDS_SPBEVT_EIQ6_MSK (0x3u)

/** \brief Offset for Ifx_MCDS_SPBEVT_Bits.EIQ6 */
#define IFX_MCDS_SPBEVT_EIQ6_OFF (12u)

/** \brief Length for Ifx_MCDS_SPBEVT_Bits.EIQ7 */
#define IFX_MCDS_SPBEVT_EIQ7_LEN (2u)

/** \brief Mask for Ifx_MCDS_SPBEVT_Bits.EIQ7 */
#define IFX_MCDS_SPBEVT_EIQ7_MSK (0x3u)

/** \brief Offset for Ifx_MCDS_SPBEVT_Bits.EIQ7 */
#define IFX_MCDS_SPBEVT_EIQ7_OFF (14u)

/** \brief Length for Ifx_MCDS_SPBEVT_Bits.EIQ8 */
#define IFX_MCDS_SPBEVT_EIQ8_LEN (2u)

/** \brief Mask for Ifx_MCDS_SPBEVT_Bits.EIQ8 */
#define IFX_MCDS_SPBEVT_EIQ8_MSK (0x3u)

/** \brief Offset for Ifx_MCDS_SPBEVT_Bits.EIQ8 */
#define IFX_MCDS_SPBEVT_EIQ8_OFF (16u)

/** \brief Length for Ifx_MCDS_SPBEVT_Bits.EIQ9 */
#define IFX_MCDS_SPBEVT_EIQ9_LEN (2u)

/** \brief Mask for Ifx_MCDS_SPBEVT_Bits.EIQ9 */
#define IFX_MCDS_SPBEVT_EIQ9_MSK (0x3u)

/** \brief Offset for Ifx_MCDS_SPBEVT_Bits.EIQ9 */
#define IFX_MCDS_SPBEVT_EIQ9_OFF (18u)

/** \brief Length for Ifx_MCDS_SPBEVT_Bits.EIQ10 */
#define IFX_MCDS_SPBEVT_EIQ10_LEN (2u)

/** \brief Mask for Ifx_MCDS_SPBEVT_Bits.EIQ10 */
#define IFX_MCDS_SPBEVT_EIQ10_MSK (0x3u)

/** \brief Offset for Ifx_MCDS_SPBEVT_Bits.EIQ10 */
#define IFX_MCDS_SPBEVT_EIQ10_OFF (20u)

/** \brief Length for Ifx_MCDS_SPBEVT_Bits.EIQ11 */
#define IFX_MCDS_SPBEVT_EIQ11_LEN (2u)

/** \brief Mask for Ifx_MCDS_SPBEVT_Bits.EIQ11 */
#define IFX_MCDS_SPBEVT_EIQ11_MSK (0x3u)

/** \brief Offset for Ifx_MCDS_SPBEVT_Bits.EIQ11 */
#define IFX_MCDS_SPBEVT_EIQ11_OFF (22u)

/** \brief Length for Ifx_MCDS_SPBEVT_Bits.EIQ12 */
#define IFX_MCDS_SPBEVT_EIQ12_LEN (2u)

/** \brief Mask for Ifx_MCDS_SPBEVT_Bits.EIQ12 */
#define IFX_MCDS_SPBEVT_EIQ12_MSK (0x3u)

/** \brief Offset for Ifx_MCDS_SPBEVT_Bits.EIQ12 */
#define IFX_MCDS_SPBEVT_EIQ12_OFF (24u)

/** \brief Length for Ifx_MCDS_SPBEVT_Bits.EIQ13 */
#define IFX_MCDS_SPBEVT_EIQ13_LEN (2u)

/** \brief Mask for Ifx_MCDS_SPBEVT_Bits.EIQ13 */
#define IFX_MCDS_SPBEVT_EIQ13_MSK (0x3u)

/** \brief Offset for Ifx_MCDS_SPBEVT_Bits.EIQ13 */
#define IFX_MCDS_SPBEVT_EIQ13_OFF (26u)

